app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("content", "user_id", "created_at", "updated_at", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @blog = Blog.new(blog_params)
    @blog.user_id = current_user.id
  if params[:back]
    render :new
  else
    if @blog.save